package su.petrosoft.apk_ack_integration.model.enums;

import lombok.Getter;
import lombok.RequiredArgsConstructor;

@RequiredArgsConstructor
@Getter
public enum Dictionary {
    KVSR("КВСР", 10528, 1854, 1337, 83748),
    KFSR("КФСР", 10579, 1874, 1337, 83748),
    KCSR("КЦСР", 10630, 1882, 1883, 83748),
    KVR("КВР", 10681, 1878, 1337, 83748),
    KOSGU("КОСГУ", 10732, 1870, 1337, 83748),
    DOPEK("Доп.ЭК", 10834, 1861, 1337, 83748),
    DOPKR("Доп.КР", 10885, 1867, 1868, 83748),
    DOPFK("Доп.ФК", 19070, 3492, 1337, 83748),
    PURPOSE("Код цели", 11006, 1858, 1337, 83748),
    OWNERSHIP_FORM("Форма собственности", 25265, 589, 1337, 75730),
    FINANCING_FORM("Форма финансирования", 25327, 4294, 1337, 83748),
    PROD_COUNTRY("Страны-производители", 4718, 590, 1337, 83748),
    TECH_STATE("Техническое состояние техники/оборудования", 28325, 590, 1337, 83748),
    INDICATOR("Справочник показателей", 3585, 591, 1337, 83748),
    TR_V_M("Тракторы всех марок", 4144, 590, 1337, 83748),
    KOM_ZER("Комбайны зерноуборочные", 4195, 590, 1337, 83748),
    KOM_KOR("Комбайны кормоуборочные", 4246, 590, 1337, 83748),
    MAS_SH("Машины сельскохозяйственные", 4297, 590, 1337, 83748),
    MAS_ZH("Машины для животноводства, птицеводства и кормопроизводства", 4348, 590, 1337, 83748),
    MAS_ZH_PT_KOR("Машины для животноводства, птицеводства и кормопроизводства", 4348, 590, 1337, 83748),
    DIS_BEN_GEN("Дизельные и бензиновые генераторы для резервного питания", 4399, 590, 1337, 83748),
    MAS_KART("Машины для производства картофеля, овощей, плодов и ягод", 4450, 590, 1337, 83748),
    IZD_AVT_PR("Изделия автомобильной промышленности", 4501, 590, 1337, 83748),
    TECH_FISHING("Техника и оборудование для рыбоводства и рыболовства", 4552, 590, 1337, 83748),
    OTHER_TECH("Прочая техника и оборудование", 4603, 590, 1337, 83748),
    APP_TYPE("Вид АПП", 6579, 590, 1337, 652);

    private final String name;
    private final long templateId;
    private final long codeAttrId;
    private final long descriptionAttrId;
    private final long defaultValue;

}
