package su.petrosoft.apk_ack_integration.model.enums;

import lombok.Getter;
import lombok.RequiredArgsConstructor;

@RequiredArgsConstructor
@Getter
public enum Dictionary {
    KVSR("КВСР", 1653, 10528, 1854, 1855),
    KFSR("КФСР", 1663, 10579, 1874, 1875),
    KCSR("КЦСР", 1673, 10630, 1882, 1883),
    KVR("КВР", 1683, 10681, 1878, 1879),
    KOSGU("КОСГУ", 1693, 10732, 1870, 1871),
    DOPEK("Доп.ЭК", 1713, 10834, 1861, 1862),
    DOPKR("Доп.КР", 1723, 10885, 1867, 1868),
    DOPFK("Доп.ФК", 2852, 19070, 3492, 2863),
    PURPOSE("Код цели", 1741, 11006, 1858, 1859),
    OWNERSHIP_FORM("Форма собственности", 3363, 25265, 4293, 590),
    FINANCING_FORM("Форма финансирования", 3373, 25327, 589, 590),
    DISTRICT("Районы Ленинградской области", 1032, 6633, 4319, 2193),
    PROD_COUNTRY("Страны-производители", 734, 4718, 590, 590),
    TECH_STATE("Техническое состояние техники/оборудования", 3897, 28325, 590, 590),
    INDICATOR("Справочник показателей", 582, 3585, 591, 590),
    TR_V_M("Тракторы всех марок", 623, 4144, 590, 590),
    KOM_ZER("Комбайны зерноуборочные", 633, 4195, 590, 590),
    KOM_KOR("Комбайны кормоуборочные", 643,  4246, 590, 590),
    MAS_SH("Машины сельскохозяйственные", 653, 4297, 590, 590),
    MAS_ZH("Машины для животноводства, птицеводства и кормопроизводства", 663, 4348, 590, 590),
    DIS_BEN_GEN("Дизельные и бензиновые генераторы для резервного питания", 673, 4399, 590, 590),
    MAS_KART("Машины для производства картофеля, овощей, плодов и ягод", 683, 4450, 590, 590),
    IZD_AVT_PR("Изделия автомобильной промышленности", 693, 4501, 590, 590),
    TECH_FISHING("Техника и оборудование для рыбоводства и рыболовства", 703, 4552, 590, 590),
    OTHER_TECH("Прочая техника и оборудование", 713, 4603, 590, 590),
    APP_TYPE("Вид АПП", 1022, 6579, 590, 590);

    private final String name;
    private final long idAttrId;
    private final long templateId;
    private final long codeAttrId;
    private final long descriptionAttrId;
}
